app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2019-10-10 21:53:08.417973"], ["updated_at", "2019-10-10 21:53:08.417973"]]
INSERT INTO "songs" ("title", "created_at", "updated_at", "artist_id") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["created_at", "2019-02-26 17:36:25.531560"], ["updated_at", "2019-02-26 17:36:25.531560"], ["artist_id", 138]]
---
  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      Song.create(title: song[0], artist_name: song[1])